{
  "learning_rate": 0.0001,
  "batch_size": 16,
  "epochs": 5,
  "peft_config": {
    "inference_mode": false,
    "eva_config": null,
    "init_lora_weights": true,
    "use_bdlora": null,
    "peft_type": "LORA",
    "layers_pattern": null,
    "fan_in_fan_out": false,
    "ensure_weight_tying": false,
    "auto_mapping": null,
    "task_type": null,
    "lora_ga_config": null,
    "use_rslora": false,
    "corda_config": null,
    "layers_to_transform": null,
    "modules_to_save": null,
    "peft_version": "0.19.1",
    "exclude_modules": null,
    "revision": null,
    "arrow_config": null,
    "trainable_token_indices": null,
    "lora_bias": false,
    "use_dora": false,
    "bias": "none",
    "base_model_name_or_path": null,
    "megatron_config": null,
    "lora_dropout": 0,
    "qalora_group_size": 16,
    "alora_invocation_tokens": null,
    "layer_replication": null,
    "lora_alpha": 8,
    "r": 8,
    "target_modules": null,
    "target_parameters": null,
    "megatron_core": "megatron.core",
    "use_qalora": false
  }
}